package utils

const (
	INFO = "" +
		"Лабораторная работа №5\n" +
		"Интерполяция функции\n" +
		"Подготовила Софья Сухарева\n" +
		"P32131, ISU:334641, вариант №18"
	CHOOSE_FUNC  = "Выберите функцию: "
	CHOOSE_INPUT = "" +
		"Выберите способ ввода: " +
		"\n1: файл," +
		"\n2: терминал" +
		"\n3: готовые функции" +
		"\n1/2/3: "
	INPUT_ERR      = "Ошибка в ведённых данных. Проверьте корректность значения и повторите ввод: "
	INPUT_X0       = "Введите значение X, для которого надо найти значение функции: "
	INPUT_INTERVAL = "Задайте границы интервала через пробел: "
	NUMBER_OF_DOTS = "Количество точек должно быть целым числом." +
		"\nКоличество точек: "
	INPUT_X       = "Введите значения X через пробел: "
	INPUT_Y       = "Введите значения Y через пробел: "
	BAD_DOTS      = "Точки не равноудалённые :("
	BAD_DOT       = "Точка должна находиться внутри интервала"
	TOO_MUCH_DOTS = "Количество точек должно быть менее 19"
)
